Revit 2027 API
MemberForces Constructor
 Creates a new instance of MemberForces.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MemberForces(
	bool start,
	XYZ force,
	XYZ moment
)
Public Sub New (
	start As Boolean,
	force As XYZ,
	moment As XYZ
)
public:
MemberForces(
	bool start,
	XYZ^ force,
	XYZ^ moment
)
new :
        start : bool *
        force : XYZ *
        moment : XYZ -> MemberForces
Parameters
start Boolean
 Member Forces position on analytical element. True for start, false for end.
force XYZ
 The Translational forces at specified position of the element. The x value of XYZ object represents force along x-axis of the analytical element coordinate system, y along y-axis, z along z-axis respectively.
moment XYZ
 The Rotational forces at specified position of the element. The x value of XYZ object represents moment about x-axis of the analytical element coordinate system, y about y-axis, z about z-axis respectively.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MemberForces Class
Autodesk.Revit.DB.Structure Namespace